## **Análisis Exploratorio de Datos (EDA): Negocio de Ventas**

### Autor: Isabela Toledo Balcázar

### Marzo 2024

### A) Tabla "Sales"

In [62]:
# Importar librerias necesarias
import openpyxl
import pandas as pd
import numpy as np

1. Carga de datos

In [2]:
# Cargar datos a un Dataframe
dataset_path = "202403-Summan-PruebaTécnica-AnalistaDatos.xlsx"
df = pd.read_excel(dataset_path)

2. Exploración inicial

In [3]:
# Inspeccionar el dataset
df.head()

,Row_ID,Order_ID,Order_Date,Ship_Date,Ship_Mode,Customer_ID,Country/Region,City,State/Province,Postal_Code,Region,Product_ID,Sales,Quantity,Discount,Profit
0,1,US-2020-103800,2020-01-03,2020-01-07,Standard Class,DP-13000,United States,Houston,Texas,77095,Central,OFF-PA-10000174,16.448,2,0.2,5.5512
1,2,US-2020-112326,2020-01-04,2020-01-08,Standard Class,PO-19195,United States,Naperville,Illinois,60540,Central,OFF-BI-10004094,3.54,2,0.8,-5.487
2,3,US-2020-112326,2020-01-04,2020-01-08,Standard Class,PO-19195,United States,Naperville,Illinois,60540,Central,OFF-LA-10003223,11.784,3,0.2,4.2717
3,4,US-2020-112326,2020-01-04,2020-01-08,Standard Class,PO-19195,United States,Naperville,Illinois,60540,Central,OFF-ST-10002743,272.736,3,0.2,-64.7748
4,5,US-2020-141817,2020-01-05,2020-01-12,Standard Class,MB-18085,United States,Philadelphia,Pennsylvania,19143,East,OFF-AR-10003478,19.536,3,0.2,4.884

In [5]:
# Obtener descripción de la estructura e información básica del contenido del DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11742 entries, 0 to 11741
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Row_ID          11742 non-null  int64
 1   Order_ID        11742 non-null  object
 2   Order_Date      11742 non-null  datetime64[ns]
 3   Ship_Date       11742 non-null  datetime64[ns]
 4   Ship_Mode       11742 non-null  object
 5   Customer_ID     11742 non-null  object
 6   Country/Region  11671 non-null  object
 7   City            11742 non-null  object
 8   State/Province  11742 non-null  object
 9   Postal_Code     11742 non-null  object
 10  Region          11742 non-null  object
 11  Product_ID      11742 non-null  object
 12  Sales           11742 non-null  object
 13  Quantity        11742 non-null  int64
 14  Discount        11742 non-null  float64
 15  Profit          11742 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(2), object(11)
memory usage: 1.4+ MB

* El dataset tiene 11742 filas y 16 columnas
* Se observa inicialmente que hay datos nulos en la columna "Country/Region"
* Columnas como "Sales" y "Profit" deberían ser de tipo numérico

3. Limpieza de datos

* Remover duplicados

In [6]:
# Chequear si hay valores duplicados
print("Filas duplicadas:", df.duplicated().sum())

Filas duplicadas: 1547

In [7]:
# Remover duplicados
df.drop_duplicates(inplace=True)
print('Filas duplicadas:', df.duplicated().sum())
df.shape

Filas duplicadas: 0

(10195, 16)

* Manejo de datos faltantes

In [8]:
# Chequear si hay valores faltantes
df.isnull().sum().sort_values(ascending = False)

Country/Region    63
Row_ID             0
Order_ID           0
Order_Date         0
Ship_Date          0
Ship_Mode          0
Customer_ID        0
City               0
State/Province     0
Postal_Code        0
Region             0
Product_ID         0
Sales              0
Quantity           0
Discount           0
Profit             0
dtype: int64

In [9]:
# Extraigo un subset del df para ver las filas nulas de la columna "Country/Region" más su correspondiente ciudad
# Para llenar valores faltantes de acuerdo a los valores de la columna "Order_ID"
filas_pais_nulo = df[df["Country/Region"].isnull()]
subset_df = filas_pais_nulo[["Country/Region", "Order_ID"]]
print(subset_df)

      Country/Region        Order_ID
68               NaN  US-2020-110422
318              NaN  US-2020-101770
392              NaN  US-2020-102715
393              NaN  US-2020-102715
395              NaN  US-2020-102715
...              ...             ...
10196            NaN  US-2023-144694
10206            NaN  US-2023-144694
10723            NaN  US-2023-161130
11196            NaN  US-2023-148768
11252            NaN  US-2023-164917

[63 rows x 2 columns]

In [10]:
#Hallo cuales son los valores unicos de Order_ID
#Si Order_ID empieza con 'US-' la orden fue en Estados unidos, si empieza con 'CA-' fue en Canada
valores_unicos_ORDERID = subset_df["Order_ID"].unique()
print("valores correspondientes de columna Order ID:", valores_unicos_ORDERID)

valores correspondientes de columna Order ID: ['US-2020-110422' 'US-2020-101770' 'US-2020-102715' 'US-2020-156244'
 'US-2020-130918' 'US-2020-169775' 'US-2020-107573' 'US-2020-113166'
 'US-2021-143532' 'US-2021-103793' 'US-2021-101868' 'US-2021-147011'
 'US-2021-162761' 'US-2021-105571' 'US-2021-136147' 'US-2021-163965'
 'US-2021-141754' 'US-2022-122518' 'US-2022-169103' 'US-2022-160598'
 'US-2022-142902' 'US-2022-153318' 'US-2022-165827' 'US-2022-158309'
 'US-2022-135209' 'US-2023-148999' 'US-2023-161851' 'US-2023-151218'
 'US-2023-133781' 'US-2023-148810' 'US-2023-152492' 'US-2023-146878'
 'US-2023-121314' 'US-2023-144694' 'US-2023-161130' 'US-2023-148768'
 'US-2023-164917']

In [11]:
#Lleno los valores faltantes de la columna "Country/Region" con "United States" porque se comprobró con el Order ID que
#todos los datos faltantes correspondian a ordenes de Estados Unidos
df["Country/Region"].fillna("United States", inplace=True)
print("Valores nulos en la columna Country/Region:", df["Country/Region"].isnull().sum())

Valores nulos en la columna Country/Region: 0

C:\Users\DELL\AppData\Local\Temp\ipykernel_2464\760924328.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Country/Region"].fillna("United States", inplace=True)

* Dar formato adecuado a las columnas que lo requieren

Damos formato numerico a las columnas correspondientes:

df["Sales"] = df["Sales"].astype(float)

df["Profit"] = df["Profit"].astype(float)

Sin embargo, se encontraron errores al ejecutar esas lineas de código, lo cual sugiere que hay datos no numéricos en esas columnas y deben ser corregidos.

In [12]:
# Primero, se intenta convertir los valores de la columna a numéricos
# Si hay cadenas de texto, se producirá un error y se marcarán como no numéricas
valores_numericos = pd.to_numeric(df["Sales"], errors='coerce')

# Ahora, se filtra el DataFrame original para mostrar solo las filas no numéricas de la columna "Sales"
filas_no_numericas = df["Sales"][valores_numericos.isnull()]

# Muestra las filas no numéricas
print("Filas no numéricas en columna Sales:", filas_no_numericas)

Filas no numéricas en columna Sales: 8473    o
8474    o
8475    l
Name: Sales, dtype: object

In [13]:
# Hacemos reemplazo de los datos faltantes, teniendo en cuenta el valor unitario, la cantidad y el descuento (ver Excel)
df.at[8473, "Sales"] = 5.28
df.at[8474, "Sales"] = 198.272
df.at[8475, "Sales"] = 242.352
print("Nuevo valor de la fila 8473:", df.at[8473, "Sales"])
print("Nuevo valor de la fila 8474:", df.at[8474, "Sales"])
print("Nuevo valor de la fila 8475:", df.at[8475, "Sales"])

Nuevo valor de la fila 8473: 5.28
Nuevo valor de la fila 8474: 198.272
Nuevo valor de la fila 8475: 242.352

In [14]:
# Ahora se cambia el formato de la columna "Sales" a numérico
df["Sales"] = df["Sales"].astype(float)

In [15]:
# Se repite el mismo proceso para corregir el dato no numerico de la columna "Profit"
valores_numericos_profit = pd.to_numeric(df["Profit"], errors='coerce')
filas_no_numericas_profit = df["Profit"][valores_numericos_profit.isnull()]

# Muestra las filas no numéricas
print("Filas no numéricas en columna Profit:", filas_no_numericas_profit)

Filas no numéricas en columna Profit: 10189    nulo
Name: Profit, dtype: object

In [16]:
# Hacemos reemplazo de los datos faltantes y cambiamos formato de la columna
df.at[10189, "Profit"] = 71.928
print("Nuevo valor de la fila 10189:", df.at[10189, "Profit"])

Nuevo valor de la fila 10189: 71.928

In [17]:
# Ahora se cambia el formato de la columna "Profit" a numérico
df["Profit"] = df["Profit"].astype(float)

3. Estadística descriptiva

In [18]:
df.describe()

,Row_ID,Order_Date,Ship_Date,Sales,Quantity,Discount,Profit
count,10195.000000,10195,10195,1.019500e+04,10195.000000,10195.000000,10195.000000
mean,5097.726336,2022-05-01 03:50:30.779793920,2022-05-03 16:30:33.369298688,4.151538e+03,11.419814,0.156331,28.670838
min,1.000000,2020-01-03 00:00:00,2020-01-07 00:00:00,4.440000e-01,1.000000,0.000000,-6599.978000
25%,2549.500000,2021-05-14 00:00:00,2021-05-19 00:00:00,1.722000e+01,2.000000,0.000000,1.760800
50%,5098.000000,2022-06-26 00:00:00,2022-06-28 00:00:00,5.392000e+01,3.000000,0.200000,8.690000
75%,7645.500000,2023-05-14 00:00:00,2023-05-18 00:00:00,2.095000e+02,5.000000,0.200000,29.293850
max,10194.000000,2033-11-16 00:00:00,2024-01-05 00:00:00,3.000000e+07,77777.000000,10.000000,8399.976000
std,2942.843045,NaN,NaN,3.131775e+05,770.261550,0.228129,232.453859

* Row_ID es una columna que puede ser eliminada ya que solo es una columna con el mismo valor del index
* Se ve que en la columna "Order_Date" el valor más alto corresponde al año 2033. Esto es un error porque los datos comprenden las fechas de ventas entre los años 2020 y 2023. Continuamos con el proceso de limpieza al encontrar nuevas inconsistencias (es un proceso iterativo)
* El valor máximo en la columna "Quantity" correspondiente a 77777 debe revisarse
* El valor máximo en la columna "Discount" es un error, debido a que los valores de esa columna van entre 0 y 1

In [19]:
# Eliminamos columna "Row_ID"
df = df.drop("Row_ID", axis = 1)
df.head()

,Order_ID,Order_Date,Ship_Date,Ship_Mode,Customer_ID,Country/Region,City,State/Province,Postal_Code,Region,Product_ID,Sales,Quantity,Discount,Profit
0,US-2020-103800,2020-01-03,2020-01-07,Standard Class,DP-13000,United States,Houston,Texas,77095,Central,OFF-PA-10000174,16.448,2,0.2,5.5512
1,US-2020-112326,2020-01-04,2020-01-08,Standard Class,PO-19195,United States,Naperville,Illinois,60540,Central,OFF-BI-10004094,3.540,2,0.8,-5.4870
2,US-2020-112326,2020-01-04,2020-01-08,Standard Class,PO-19195,United States,Naperville,Illinois,60540,Central,OFF-LA-10003223,11.784,3,0.2,4.2717
3,US-2020-112326,2020-01-04,2020-01-08,Standard Class,PO-19195,United States,Naperville,Illinois,60540,Central,OFF-ST-10002743,272.736,3,0.2,-64.7748
4,US-2020-141817,2020-01-05,2020-01-12,Standard Class,MB-18085,United States,Philadelphia,Pennsylvania,19143,East,OFF-AR-10003478,19.536,3,0.2,4.8840

In [26]:
# Corregimos la columna "Order_Date" para aquellos registros mayores al año 2023
filas_mayor_2023 = df[df["Order_Date"] >= "2024-01-01"]
print(filas_mayor_2023)

             Order_ID Order_Date  Ship_Date       Ship_Mode Customer_ID  \
3250   US-2021-112711 2031-07-12 2021-07-18  Standard Class    FM-14380
3934   US-2021-139731 2031-10-15 2021-10-15        Same Day    JE-15745
3941   US-2021-139731 2031-10-15 2021-10-15        Same Day    JE-15745
10947  US-2023-114657 2033-11-16 2023-11-21  Standard Class    MH-18115

      Country/Region      City State/Province Postal_Code   Region  \
3250   United States  Amarillo          Texas       79109  Central
3934   United States  Amarillo          Texas       79109  Central
3941   United States  Amarillo          Texas       79109  Central
10947  United States   Yonkers       New York       10701     East

            Product_ID     Sales  Quantity  Discount    Profit
3250   TEC-PH-10000526   307.168         4       0.2   30.7168
3934   FUR-CH-10002024  2453.430         5       0.3 -350.4900
3941   TEC-AC-10004975   263.880         3       0.2   42.8805
10947  TEC-MA-10003173    52.440         4       0.0   24.1224

In [30]:
# Se encuentran 4 filas en la columna "Order_Date" con fecha erronea
# Se procede a corregir dichos datos
df.at[3250, "Order_Date"] = pd.to_datetime("2021-07-12")
df.at[3934, "Order_Date"] = pd.to_datetime("2021-10-15")
df.at[3941, "Order_Date"] = pd.to_datetime("2021-10-15")
df.at[10947, "Order_Date"] = pd.to_datetime("2023-11-16")

filas_mayor_2023 = df[df["Order_Date"] >= "2024-01-01"]
print(filas_mayor_2023)

Empty DataFrame
Columns: [Order_ID, Order_Date, Ship_Date, Ship_Mode, Customer_ID, Country/Region, City, State/Province, Postal_Code, Region, Product_ID, Sales, Quantity, Discount, Profit]
Index: []

* Manejo de Outliers en columnas "Quantity" y "Discount"

In [100]:
# Para columna "Quantity"
# Usamos el método Interquartile Range (IQR)
# Calculo de IQR
#Q1 = df["Quantity"].quantile(0.25)
#Q3 = df["Quantity"].quantile(0.75)
#IQR = Q3 - Q1

# Definicion de limites para los outliers
#lower_bound = Q1 - 1.5 * IQR
#upper_bound = Q3 + 1.5 * IQR

# Filtrando los outliers
#df = df[(df["Quantity"] >= lower_bound) & (df["Quantity"] <= upper_bound)]
media_Quantity = df["Quantity"].mean()
mediana_Quantity = df["Quantity"].median()
print("Media Quantity:", media_Quantity)
print("Mediana Quantity:", mediana_Quantity)

Media Quantity: 3.6550209622679177
Mediana Quantity: 3.0

In [101]:
# Remmplazamos el outlier 77777 por la mediana (más sensible a valores extremos)
df.loc[df["Quantity"] == 77777, "Quantity"] = mediana_Quantity
df.describe()

,Order_Date,Ship_Date,Sales,Quantity,Discount,Profit,Order_Year,Order_month,0rder_day,Cost
count,10018,10018,1.001800e+04,10018.000000,10018.000000,10018.000000,10018.000000,10018.000000,10018.000000,1.001800e+04
mean,2022-04-30 13:17:54.465961472,2022-05-04 12:21:16.422439424,4.214791e+03,3.655021,0.155537,27.490945,2021.722999,7.805750,15.445199,4.187300e+03
min,2020-01-03 00:00:00,2020-01-07 00:00:00,4.440000e-01,1.000000,0.000000,-6599.978000,2020.000000,1.000000,1.000000,5.544000e-01
25%,2021-05-18 12:00:00,2021-05-23 06:00:00,1.690000e+01,2.000000,0.000000,1.730250,2021.000000,5.000000,8.000000,1.227473e+01
50%,2022-06-26 00:00:00,2022-06-29 00:00:00,5.195000e+01,3.000000,0.200000,8.469600,2022.000000,9.000000,15.000000,4.048265e+01
75%,2023-05-14 00:00:00,2023-05-18 00:00:00,2.048875e+02,5.000000,0.200000,28.497000,2023.000000,11.000000,23.000000,1.775219e+02
max,2023-12-30 00:00:00,2024-01-05 00:00:00,3.000000e+07,9.000000,0.800000,8399.976000,2023.000000,12.000000,31.000000,3.000000e+07
std,NaN,NaN,3.159319e+05,1.981540,0.206426,227.424073,1.124403,3.294351,8.725549,3.159318e+05

In [39]:
# Para columna "Discount"
# Se asume que los descuento van de 0 a 1
df = df[(df["Discount"] >= 0) & (df["Discount"] <= 1)]

df.describe()

,Order_Date,Ship_Date,Sales,Quantity,Discount,Profit
count,10018,10018,1.001800e+04,10018.000000,10018.000000,10018.000000
mean,2022-04-30 13:17:54.465961472,2022-05-04 12:21:16.422439424,4.214791e+03,3.655021,0.155537,27.490945
min,2020-01-03 00:00:00,2020-01-07 00:00:00,4.440000e-01,1.000000,0.000000,-6599.978000
25%,2021-05-18 12:00:00,2021-05-23 06:00:00,1.690000e+01,2.000000,0.000000,1.730250
50%,2022-06-26 00:00:00,2022-06-29 00:00:00,5.195000e+01,3.000000,0.200000,8.469600
75%,2023-05-14 00:00:00,2023-05-18 00:00:00,2.048875e+02,5.000000,0.200000,28.497000
max,2023-12-30 00:00:00,2024-01-05 00:00:00,3.000000e+07,9.000000,0.800000,8399.976000
std,NaN,NaN,3.159319e+05,1.981540,0.206426,227.424073

* Agregación de nuevas columnas para soportar el análisis

In [41]:
# Enriquecemos los datos para tener un mejor análisis, agregando columnas respectivas de año, mes, día, mes-dia de la orden y el costo
df['Order_Year'] = df['Order_Date'].dt.year
df['Order_month'] = df['Order_Date'].dt.month
df['0rder_day'] = df['Order_Date'].dt.day
df['0rder_year_month'] = df['Order_Date'].dt.strftime('%Y-%m')
df['Cost'] = df['Sales'] - df['Profit']

df.head()

,Order_ID,Order_Date,Ship_Date,Ship_Mode,Customer_ID,Country/Region,City,State/Province,Postal_Code,Region,Product_ID,Sales,Quantity,Discount,Profit,Order_Year,Order_month,0rder_day,0rder_year_month,Cost
0,US-2020-103800,2020-01-03,2020-01-07,Standard Class,DP-13000,United States,Houston,Texas,77095,Central,OFF-PA-10000174,16.448,2,0.2,5.5512,2020,1,3,2020-01,10.8968
1,US-2020-112326,2020-01-04,2020-01-08,Standard Class,PO-19195,United States,Naperville,Illinois,60540,Central,OFF-BI-10004094,3.540,2,0.8,-5.4870,2020,1,4,2020-01,9.0270
2,US-2020-112326,2020-01-04,2020-01-08,Standard Class,PO-19195,United States,Naperville,Illinois,60540,Central,OFF-LA-10003223,11.784,3,0.2,4.2717,2020,1,4,2020-01,7.5123
3,US-2020-112326,2020-01-04,2020-01-08,Standard Class,PO-19195,United States,Naperville,Illinois,60540,Central,OFF-ST-10002743,272.736,3,0.2,-64.7748,2020,1,4,2020-01,337.5108
4,US-2020-141817,2020-01-05,2020-01-12,Standard Class,MB-18085,United States,Philadelphia,Pennsylvania,19143,East,OFF-AR-10003478,19.536,3,0.2,4.8840,2020,1,5,2020-01,14.6520

### B) Tabla "Product"

1. Carga de datos

In [45]:
# Cargar datos a un Dataframe
dataset_path = "202403-Summan-PruebaTécnica-AnalistaDatos.xlsx"
df_product = pd.read_excel(dataset_path, sheet_name= "Product")

df_product.head()

,Product_ID,Category,Sub-Category,Product_Name
0,OFF-PA-10000174,Office Supplies,Paper,"Message Book, Wirebound, Four 5 1/2"" X 4"" Form..."
1,OFF-BI-10004094,Office Supplies,Binders,GBC Standard Plastic Binding Systems Combs
2,OFF-LA-10003223,Office Supplies,Labels,Avery 508
3,OFF-ST-10002743,Office Supplies,Storage,SAFCO Boltless Steel Shelving
4,OFF-AR-10003478,Office Supplies,Art,Avery Hi-Liter EverBold Pen Style Fluorescent ...

2. Exploración inicial

In [46]:
df_product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1894 entries, 0 to 1893
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Product_ID    1894 non-null   object
 1   Category      1894 non-null   object
 2   Sub-Category  1894 non-null   object
 3   Product_Name  1894 non-null   object
dtypes: object(4)
memory usage: 59.3+ KB

* El dataset tiene 4 columnas, 1894 filas
* No hay valores nulos
* No hay que cambiar el formato de los datos

In [47]:
# Chequear si hay duplicados
print("Filas duplicadas:", df_product.duplicated().sum())

Filas duplicadas: 0

* No hay duplicados
* Al no haber datos numéricos, no se hace identificación de outliers ni el análisis descriptivo

### C) Tabla "Customer"

1. Carga de datos

In [55]:
# Cargar datos a un Dataframe
dataset_path = "202403-Summan-PruebaTécnica-AnalistaDatos.xlsx"
df_customer = pd.read_excel(dataset_path, sheet_name= "Customer")

df_customer.head()

,Customer_ID,Customer_Name,monthly_salary,age,marital_status [1:married/ 0:Single],credit score
0,AA-10315,Alex Avila,6349,32,1,500
1,AA-10375,Allen Armold,5374,26,0,630
2,AA-10480,Andrew Allen,9611,44,1,780
3,AA-10645,Anna Andreadi,7025,43,1,450
4,AB-10015,Aaron Bergman,3331,28,1,490

2. Exploración inicial

In [57]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 804 entries, 0 to 803
Data columns (total 6 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   Customer_ID                           804 non-null    object
 1   Customer_Name                         804 non-null    object
 2   monthly_salary                        804 non-null    object
 3   age                                   804 non-null    int64
 4   marital_status [1:married/ 0:Single]  804 non-null    object
 5   credit score                          804 non-null    int64
dtypes: int64(2), object(4)
memory usage: 37.8+ KB

* El dataset tiene 6 columnas y 804 filas
* No hay valores nulos
* La columna "monthly_salary" no se reconoció como dato numérico, lo que puede significar que hay uno o varios datos de otro tipo
* La columna "marital_status" no se reconoció como dato numérico, lo que puede significar que hay uno o varios datos de otro tipo

3. Limpieza de datos

In [58]:
#Chequeo de duplicados
print("Filas duplicadas:", df_customer.duplicated().sum())

Filas duplicadas: 0

In [59]:
# Revisión columna "monthly_salary"
print("Valores unicos:", df_customer["monthly_salary"].unique())

Valores unicos: [6349 5374 9611 7025 3331 8511 7199 7838 6957 8601 4338 7262 3924 3157
 4903 4505 2101 9892 2676 4242 2166 8311 8500 8893 3625 5443 2259 6300
 6721 6731 3177 4014 3191 5759 9727 2696 3935 2853 9281 9559 9915 5945
 7165 8444 8034 8795 6865 7486 2982 7255 7195 7472 6855 7293 7619 9563
 8295 6944 4481 4493 6343 9983 4876 3952 8339 4310 8361 7626 8553 2093
 8059 3608 4351 4982 5704 2121 7876 8699 4036 5392 4974 9083 8390 8937
 2344 6206 6172 8502 3370 6234 2307 6609 5495 4392 9465 9111 7685 7238
 5455 9565 5603 9568 9649 9558 8104 8042 5513 3906 2007 6215 4411 3130
 9945 6767 5967 2212 5046 7553 9857 7503 5245 5128 5635 9244 8382 3188
 2350 8582 2081 7895 6194 3614 8136 2866 5708 8656 9639 9584 9908 6582
 2067 7142 8931 7749 6193 7200 7640 5819 9525 2339 3479 2509 5842 6973
 4037 4006 3335 2642 4569 5660 7454 6367 'x' 4537 6637 4722 4489 6031 5315
 5483 7577 4233 3673 5038 6089 9730 3496 8723 5032 7128 5969 7688 2463
 9198 3292 8572 9932 4576 6524 4352 8203 7493 2231 7700 3634 7153 3607
 2220 4270 7406 9099 8342 7926 6017 5642 4749 3023 9580 9768 4909 4103
 4733 3473 9922 4542 3036 8091 5710 3899 6399 2506 5091 5426 8416 5231
 5052 9298 9124 3816 4727 9373 5169 7184 9790 6073 8504 5558 6679 4922
 8533 4219 4329 6291 8391 5042 8814 7561 6219 3047 4797 5494 8552 5668
 8494 4649 9003 7578 5296 9604 5883 2047 7940 6305 7943 5276 7899 2970
 3758 3014 2868 2772 4499 9665 7434 5540 3213 5755 8733 6336 5364 8629
 9520 3945 2411 4520 7411 8894 5607 2615 2581 8949 4523 2534 5493 7916
 3043 7448 5458 2992 6301 5950 6700 9784 6113 3340 7977 7753 2688 8543
 3433 8700 8739 7362 6528 5399 7779 2788 5824 6920 9820 6047 5853 2064
 9990 9552 2298 2883 3285 8191 2639 5737 7283 7395 3196 4443 7311 8527
 5410 8323 7224 6648 8830 6287 3764 3542 4304 9308 7485 5918 7250 9980
 2833 3713 4182 4017 9806 3569 4115 5763 2213 3627 8242 2555 2414 8459
 2743 9653 2186 7053 3588 2201 4389 4296 2005 9829 3355 4522 2127 7018
 3475 9946 6509 2821 2123 3519 10000 4670 7285 5563 4993 8741 4230 3377
 3174 2971 7482 9940 3218 5221 7111 5899 2899 2250 6674 6205 4630 5332
 6562 5906 8984 8621 8762 4679 5869 5618 8963 7804 9087 7569 3296 5808
 4260 7036 7339 2723 2636 4941 2838 3245 3015 3021 7177 8934 5255 3545
 9336 3964 9400 6067 9884 3950 7299 6461 5069 5232 3418 8158 6796 5249
 3183 8800 9203 6782 7333 6691 2644 3654 4160 2629 7524 9119 9692 3878
 2367 8209 2287 4376 4373 6828 6135 4222 8548 6937 8555 3422 6388 7241
 6639 2180 9136 6354 8681 8111 4261 3578 9521 6087 4586 6427 6072 5162
 9943 9114 3209 2784 4232 9830 4193 4369 2748 5858 5644 4498 8577 7086
 6007 9276 7537 2994 7112 9131 5705 8905 8818 2360 5797 4957 3455 8353
 8503 3526 4009 2984 2328 5478 7490 2489 8127 4528 9589 3017 8702 8023
 6289 6441 6709 2919 6120 6127 6676 9060 3649 9948 8171 6227 5900 7425
 6028 2704 7812 2706 4504 8590 2390 2888 2451 4664 4446 3631 5035 6926
 3332 4848 2918 6417 7817 6583 6840 5472 4979 7372 5184 5672 5682 9421
 4363 8757 8290 3744 8122 7120 7803 4085 8325 5520 6789 7343 8121 8685
 9654 7183 2648 6638 6874 4691 8520 8907 7570 5381 3194 4213 9695 6581
 6545 4133 5367 7473 6523 2519 5745 6003 8690 5225 8593 9230 7234 6376
 9965 6062 5329 5048 8320 6665 2102 8985 2388 5152 6538 3259 9357 4375
 6112 6373 8480 8961 4662 2055 3425 6817 9515 7254 4927 7635 8883 8939
 4847 5171 2549 7509 5306 7098 7874 8871 7911 6290 8701 5822 2513 4705
 8990 8451 3178 7955 9620 6092 6854 6625 8411 9814 5246 3301 5057 2333
 7119 5752 9972 6785 5775 4447 8144 9993 4831 2600 3584 4495 4781 3134
 3910 3312 2999 5163 8001 5103 8318 9529 6134 8580 4946 3904 7630 6693
 4885 9953 7105 4249 2496 2444 8053 4973 6843 8955 6760 2579 3870 6438
 6168 8676 4330 9056 7730 3012 7879 9709 7944 5514 4265 8662 2571 5325
 4723 6832 4452 4839 5247 2162 9761 3751 2046 9641 6935 6445 7354 7658
 4286 2288 5661 4823 5070 7597 3255 6447 4381 9212 4343 2924 7919 9887
 3158 8112 6650 2757 6506 8011 4408 8740]

In [68]:
# Se observa que hay un dato no numérico 'x'
# Procedemos a reemplazarlo con la mediana de los salarios
df_customer["monthly_salary"] = df_customer["monthly_salary"].replace("x", np.nan)

media_salario = df_customer["monthly_salary"].mean()
mediana_salario = df_customer["monthly_salary"].median()
print("Media salario:", media_salario)
print("Mediana salario:", mediana_salario)

df_customer["monthly_salary"] = df_customer["monthly_salary"].fillna(mediana_salario)

Media salario: 6029.302615193026
Mediana salario: 6067.0

In [75]:
# Revision columna "marital_status"
print("Valores unicos en columa marital_status:", df_customer["marital_status [1:married/ 0:Single]"].unique())

Valores unicos en columa marital_status: [1 0 'f' 'x' 'mm']

* Solo deberían haber dos opciones de datos: 1 o 0
* Por la naturaleza de la columna, se procede a eliminar aquellas filas que no tienen 0 o 1

In [76]:
df_customer_filtrado = df_customer[df_customer["marital_status [1:married/ 0:Single]"].astype(str).isin(['0', '1'])]
print("Valores unicos en columa marital_status:", df_customer_filtrado["marital_status [1:married/ 0:Single]"].unique())

Valores unicos en columa marital_status: [1 0]

4. Estadística descriptiva

In [77]:
df_customer_filtrado.describe()

       monthly_salary         age  credit score
count      799.000000  799.000000    799.000000
mean      6030.841051   38.381727    557.534418
std       2297.359237   10.918275    148.950560
min       2005.000000   26.000000    300.000000
25%       4203.000000   32.000000    420.000000
50%       6067.000000   38.000000    560.000000
75%       7966.000000   44.000000    690.000000
max      10000.000000  260.000000    800.000000

* El valor máximo de la columna "Age" es 260, lo cual es un error

In [80]:
# Revisión columna "age"
print("Valores unicos en columa Age:", df_customer_filtrado["age"].unique())
mediana_edad = df_customer_filtrado["age"].median()
print("Mediana edad:", mediana_edad)

Valores unicos en columa Age: [ 32  26  44  43  28  41  47  50  35  36  42  27  31  30  49  34  45  48
  46  39  33  38  37  29  40 115 260]
Mediana edad: 38.0

In [85]:
#Procedemos a reemplazar dicho dato erroneo
df_customer_filtrado.loc[df_customer_filtrado["age"] == 260, "age"] = mediana_edad
print("Valores unicos en columa Age:", df_customer_filtrado["age"].unique())

Valores unicos en columa Age: [ 32  26  44  43  28  41  47  50  35  36  42  27  31  30  49  34  45  48
  46  39  33  38  37  29  40 115]

In [86]:
df_customer_filtrado.describe()

       monthly_salary         age  credit score
count      799.000000  799.000000    799.000000
mean      6030.841051   38.103880    557.534418
std       2297.359237    7.588441    148.950560
min       2005.000000   26.000000    300.000000
25%       4203.000000   32.000000    420.000000
50%       6067.000000   38.000000    560.000000
75%       7966.000000   44.000000    690.000000
max      10000.000000  115.000000    800.000000

### D) Tabla "Regional_Manager"

1. Carga de datos

In [88]:
# Cargar datos a un Dataframe
dataset_path = "202403-Summan-PruebaTécnica-AnalistaDatos.xlsx"
df_manager = pd.read_excel(dataset_path, sheet_name = "Regional_Manager")

df_manager.head()

    Regional_Manager    Region
0    Sadie Pawthorne     Wes t
1        Chuck Magee      east
2  Roxanne Rodriguez  cenntral
3        Fred Suzuki     south

2. Exploración inicial

In [89]:
df_manager.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Regional_Manager  4 non-null      object
 1   Region            4 non-null      object
dtypes: object(2)
memory usage: 196.0+ bytes

In [90]:
# El unico error a corregir es la palabra "West" que tiene un espacio e inicial mayuscula cuando los demas datos no
df_manager.loc[df_manager["Region"] == "Wes t", "Region"] = "west"
df_manager.head()

    Regional_Manager    Region
0    Sadie Pawthorne      west
1        Chuck Magee      east
2  Roxanne Rodriguez  cenntral
3        Fred Suzuki     south

### E) Tabla "Returns"

1. Carga de datos

In [91]:
# Cargar datos a un Dataframe
dataset_path = "202403-Summan-PruebaTécnica-AnalistaDatos.xlsx"
df_returns = pd.read_excel(dataset_path, sheet_name = "Returns")

df_returns.head()

  Returned        Order_ID
0      Yes  US-2020-100762
1      Yes  US-2020-100762
2      Yes  US-2020-100762
3      Yes  US-2020-100762
4      Yes  US-2020-100867

2. Exploracion inicial

In [95]:
df_returns.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Returned  800 non-null    object
 1   Order_ID  800 non-null    object
dtypes: object(2)
memory usage: 12.6+ KB

* No hat valores nulos
* Las dos columnas son tipo cadena
* No se hace análisis estadistico

In [96]:
# Se chequea que la columna "Returned" contenga solo el valor "Yes"
print("Valores unicos en columa Returned:", df_returns["Returned"].unique())

Valores unicos en columa Returned: ['Yes']

### F) Exportación de los dataframes a nuevo archivo excel

In [97]:
# Exportamos los DataFrames a un nuevo archivo Excel que contendrá las mismas tablas pero despues de la limpieza
with pd.ExcelWriter("Cleaned_Dataset.xlsx", engine='xlsxwriter') as writer:
    df.to_excel(writer, sheet_name = "Sales", index = False)
    df_product.to_excel(writer, sheet_name = "Product", index = False)
    df_customer_filtrado.to_excel(writer, sheet_name = "Customer", index = False)
    df_manager.to_excel(writer, sheet_name = "Regional_Manager", index = False)
    df_returns.to_excel(writer, sheet_name = "Returns", index = False)